[
    {
        "title": "Software Engineer",
        "timePeriod": "January 2023 - July 2023",
        "company": "Zmanda, BETSOL",
        "description": [
            "Resolved security issues in legacy code and dependencies and ensured application-wide compatibility, impacting 80% of the user base.",
            "Contributed to the development of a deduplication feature, reducing backup storage by 50-90% in enterprise environments.",
            "Fixed critical bugs that affected tape backups’ integrity, which affected over 80% of users and terabytes of data.",
            "Optimized and maintained 6+ core Zmanda Git repositories, ensuring seamless version control across multiple teams.",
            "Contributed to Amanda Community (Open-Source) and Enterprise editions, improving system reliability.",
            "Spearheaded the Build and Packaging team; automated CI/CD pipelines in GitLab and Jenkins for Python, C, Perl, and Golang applications.",
            "Led and managed project plans for multiple program increments within the Scaled Agile Framework, achieving near 100% on-time delivery and alignment with project goals."
          ]
          
    },
    {
        "title": "Associate Software Engineer",
        "timePeriod": "July 2021 - December 2022",
        "company": "Zmanda, BETSOL",
        "description": [
            "Developed and enhanced a monitoring feature using Django Rest Framework, reducing data latency by 95% and tracking 100+ critical jobs and workflows in near real-time.",
            "Designed and developed multiple Proofs of Concept, including Disaster Recovery and Global Data Deduplication, resulting in a 50-90% reduction in backup storage.",
            "Collaborated with cross-functional teams to resolve over 100 critical production bugs reported by a large user base.",
            "Mentored 5+ interns in building Proofs of Concept and developing various product services, leading to successful project completions and enhanced team productivity."
        ]
    },
    {
        "title": "Software Engineer Intern",
        "timePeriod": "March 2021 - June 2021",
        "company": "Zmanda, BETSOL",
        "description": [
            "Responsible for designing and implementing POCs using RESTful APIs to monitor critical backup and restore jobs in Zmanda.",
            "Successfully built the backend and data pipelines for the monitoring feature."
        ]
          
    },
    {
        "title": "Data Analysis Intern",
        "timePeriod": "January 2020 - February 2020",
        "company": "National Institute Of Technology, Chennai, India",
        "description": [
            "Analyzed Arctic data, including Sound Speed Profiles, Salinity, Temperature, and Wind Speed, utilizing unsupervised clustering techniques (K-Means, DBSCAN, Agglomerative).",
            "Implemented supervised learning methods to predict vessel movement in the Arctic region through analysis of Sound Speed Profiles.",
            "Utilized visualization techniques to effectively communicate clusters and data point relationships in the analyzed data."
          ]
    }
]